package 배열_배열문제풀이;

public class 배열2차원 {

	public static void main(String[] args) {
		
		// 2차원배열
		int[][] 온도 = new int[2][7];
		
		/* 		
		온도[0] = -4;
		온도[1] = -3;
		온도[2] = 1;
		온도[3] = -2;
		온도[4] = -2;
		온도[5] = -1;
		온도[6] = 0;
		*/
		
		//첫번째행 정보
		온도[0][0] = -4;
		온도[0][1] = -3;
		온도[0][2] = 1;
		온도[0][3] = -2;
		온도[0][4] = -2;
		온도[0][5] = -1;
		온도[0][6] = 0;
		
		//두번째행 정보
		온도[1][0] = 2;
		온도[1][1] = 2;
		온도[1][2] = 1;
		온도[1][3] = -4;
		온도[1][4] = 0;
		온도[1][5] = 1;
		온도[1][6] = 2;
		
		//2차원 배열 출력하기 
		for(int i=0;i<2;i++) { //행
			System.out.println("\n"+i+1+"주 온도:");
			for(int j=0;j<7;j++) { //열
				System.out.println(온도[i][j]);
			}
		}
		
		
		

	}

}
